dgoodlad/rtl8710-pac/rtl8710.svd
<?xml version="1.0" encoding="utf-8"?>

<!-- NOTE: This is *not* an official Realtek-supplied SVD -->

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" >
  <vendor>Realtek Semiconductor</vendor>
  <vendorID>RTL</vendorID>
  <name>RTL8710AF</name>
  <series>Ameba</series>
  <version>0.1</version>
  <description>Realtek RTL8710 Cortex-M3-based WiFi Module</description>
  <licenseText>
    Copyright (c) 2019 David Goodlad

    Permission is hereby granted, free of charge, to any person obtaining a copy
    of this software and associated documentation files (the "Software"), to deal
    in the Software without restriction, including without limitation the rights
    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
    copies of the Software, and to permit persons to whom the Software is
    furnished to do so, subject to the following conditions:

    The above copyright notice and this permission notice shall be included in all
    copies or substantial portions of the Software.

    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
    SOFTWARE.
  </licenseText>

  <cpu>
    <name>CM3</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>true</vendorSystickConfig>
  </cpu>

  <!-- TODO -->
  <addressUnitBits>8</addressUnitBits>     <!-- byte addressable memory -->
  <width>32</width>                        <!-- bus width is 32 bits -->

  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>

  <peripherals>
    <peripheral>
      <name>GPIO</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPIOA_DR</name>
          <description>GPIOA Data Register</description>
          <addressOffset>0x0000</addressOffset>
          <fields>
            <field>
              <name>E3</name>
              <description>Pin E3</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E2</name>
              <description>Pin E2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E1</name>
              <description>Pin E1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C4</name>
              <description>Pin C4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3</name>
              <description>Pin C3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1</name>
              <description>Pin C1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B4</name>
              <description>Pin B4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3</name>
              <description>Pin B3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A1</name>
              <description>Pin A1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A0</name>
              <description>GPIO pin A0 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOA_DDR</name>
          <description>GPIOA Data Direction Register</description>
          <addressOffset>0x0004</addressOffset>
          <fields>
            <field>
              <name>E3</name>
              <description>Pin E3</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E2</name>
              <description>Pin E2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E1</name>
              <description>Pin E1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C4</name>
              <description>Pin C4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3</name>
              <description>Pin C3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1</name>
              <description>Pin C1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B4</name>
              <description>Pin B4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3</name>
              <description>Pin B3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A1</name>
              <description>Pin A1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A0</name>
              <description>GPIO pin A0 data direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOB_DDR</name>
          <description>GPIOB Data Direction Register</description>
          <addressOffset>0x0010</addressOffset>
          <fields>
            <field>
              <name>E3</name>
              <description>Pin E3</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E2</name>
              <description>Pin E2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E1</name>
              <description>Pin E1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C4</name>
              <description>Pin C4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3</name>
              <description>Pin C3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1</name>
              <description>Pin C1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B4</name>
              <description>Pin B4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3</name>
              <description>Pin B3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A1</name>
              <description>Pin A1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A0</name>
              <description>GPIO pin A0 data direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOA_CTRL</name>
          <description>GPIOA Control Register</description>
          <addressOffset>0x0008</addressOffset>
          <fields>
            <field>
              <name>E3</name>
              <description>Pin E3</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E2</name>
              <description>Pin E2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E1</name>
              <description>Pin E1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C4</name>
              <description>Pin C4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3</name>
              <description>Pin C3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1</name>
              <description>Pin C1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B4</name>
              <description>Pin B4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3</name>
              <description>Pin B3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A1</name>
              <description>Pin A1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A0</name>
              <description>GPIO pin A0 control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOB_CTRL</name>
          <description>GPIOB Control Register</description>
          <addressOffset>0x0014</addressOffset>
          <fields>
            <field>
              <name>E3</name>
              <description>Pin E3</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E2</name>
              <description>Pin E2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E1</name>
              <description>Pin E1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C4</name>
              <description>Pin C4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3</name>
              <description>Pin C3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1</name>
              <description>Pin C1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B4</name>
              <description>Pin B4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3</name>
              <description>Pin B3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A1</name>
              <description>Pin A1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A0</name>
              <description>GPIO pin A0 control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOB_DR</name>
          <description>GPIOA Data Register</description>
          <addressOffset>0x000C</addressOffset>
          <fields>
            <field>
              <name>E3</name>
              <description>Pin E3</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E2</name>
              <description>Pin E2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>E1</name>
              <description>Pin E1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C4</name>
              <description>Pin C4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C3</name>
              <description>Pin C3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1</name>
              <description>Pin C1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B4</name>
              <description>Pin B4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3</name>
              <description>Pin B3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A1</name>
              <description>Pin A1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A0</name>
              <description>GPIO pin A0 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x0030</addressOffset>
        </register>
        <register>
          <name>INT_MASK</name>
          <description>Interrupt Mask</description>
          <addressOffset>0x0034</addressOffset>
        </register>
        <register>
          <name>INT_TYPE</name>
          <description>Interrupt Type (level/edge)</description>
          <addressOffset>0x0038</addressOffset>
        </register>
        <register>
          <name>INT_POLARITY</name>
          <description>Interrupt Polarity (low/high)</description>
          <addressOffset>0x003C</addressOffset>
        </register>
        <register>
          <name>INT_STATUS</name>
          <description>Interrupt Status</description>
          <addressOffset>0x0040</addressOffset>
        </register>
        <register>
          <name>INT_RAW_STATUS</name>
          <description>Interrupt Status Without Mask</description>
          <addressOffset>0x0044</addressOffset>
        </register>
        <register>
          <name>INT_DEBOUNCE</name>
          <description>Interrupt Debounce</description>
          <addressOffset>0x0048</addressOffset>
        </register>
        <register>
          <name>INT_CLEAR</name>
          <description>Interrupt Clear</description>
          <addressOffset>0x004C</addressOffset>
        </register>
        <register>
          <name>EXT</name>
          <description>GPIO IN read or OUT read back</description>
          <addressOffset>0x0050</addressOffset>
        </register>
        <register>
          <name>INT_SYNC</name>
          <description>Is level-sensitive interrupt being sync with PCLK</description>
          <addressOffset>0x0060</addressOffset>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>Timer</name>
      <description>Timer Control</description>
      <baseAddress>0x40002000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>UART for Log</name>
      <description>UART for Log</description>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>I2C_2</name>
      <description>I2C port 2</description>
      <baseAddress>0x40003400</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>I2C_3</name>
      <description>I2C port 3</description>
      <baseAddress>0x40003800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <!-- No SDRAM on 8710...
    <peripheral>
      <name>SDR</name>
      <description>SDRAM Controller</description>
      <baseAddress>0x40005000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    -->

    <peripheral>
      <name>SPI</name>
      <description>SPI Flash Controller</description>
      <baseAddress>0x40006000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>ADC</name>
      <description>ADC</description>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>UART_0</name>
      <description>UART 0</description>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>UART_1</name>
      <description>UART 1</description>
      <baseAddress>0x40040800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>SPI_0</name>
      <description>SPI 0</description>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>SPI_1</name>
      <description>SPI 1</description>
      <baseAddress>0x40040800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>I2C_1</name>
      <description>I2C 1</description>
      <baseAddress>0x40044400</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>SDIO</name>
      <description>SDIO Host</description>
      <baseAddress>0x40058000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>GDMA0</name>
      <description>GDMA0</description>
      <baseAddress>0x40060000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0800</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>GDMA1</name>
      <description>GDMA1</description>
      <baseAddress>0x40061000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0800</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>I2S_1</name>
      <description>I2S_1</description>
      <baseAddress>0x40063000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>PCM_0</name>
      <description>PCM_0</description>
      <baseAddress>0x40064000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>PCM_1</name>
      <description>PCM_1</description>
      <baseAddress>0x40065000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>Security</name>
      <description>Security Engine</description>
      <baseAddress>0x40070000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>

    <peripheral>
      <name>WIFI</name>
      <description>WIFI REG &amp; TX/RX FIFO direct map</description>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x40000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
  </peripherals>
</device>
